; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 456587 2 1 4 8 2
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	thermograph0 - mode
	thermograph1 - mode
	spectrograph2 - mode
	infrared3 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	Star4 - direction
	GroundStation5 - direction
	Star7 - direction
	Star3 - direction
	Star6 - direction
	Star2 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
)
(:init
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon9)
	(supports instrument1 thermograph0)
	(supports instrument1 thermograph1)
	(supports instrument1 infrared3)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 Star2)
	(calibration_target instrument1 Star6)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation1)
)
(:goal (and
	(pointing satellite1 Star4)
	(have_image Phenomenon8 spectrograph2)
	(have_image Phenomenon9 infrared3)
))

)

; plan
1. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 3
2. (turn_to satellite1 star4 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 star4)
   goals met: 1 of 3
3. (turn_to satellite1 star2 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 star2)
   goals met: 0 of 3
4. (calibrate satellite1 instrument1 star2)
   added: (calibrated instrument1)
   goals met: 0 of 3
5. (turn_to satellite1 star4 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 star4)
   goals met: 1 of 3
6. (turn_to satellite1 phenomenon9 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 phenomenon9)
   goals met: 0 of 3
7. (take_image satellite1 phenomenon9 instrument1 infrared3)
   added: (have_image phenomenon9 infrared3)
   goals met: 1 of 3
8. (turn_to satellite1 star4 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 star4)
   goals met: 2 of 3
9. (turn_to satellite1 phenomenon8 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 phenomenon8)
   goals met: 1 of 3
10. (take_image satellite1 phenomenon8 instrument1 spectrograph2)
   added: (have_image phenomenon8 spectrograph2)
   goals met: 2 of 3
11. (turn_to satellite1 star4 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 star4)
   goals met: 3 of 3
